import { Chat } from '../types/types';

export const chats: Chat[] = [
  {
    name: 'Андрей',
    lastMessage: 'Изображение',
    unread: 2,
    time: '10:49',
    yourMessageLast: false,
    isActive: true,
    messages: [
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: false,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: false,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: true,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: false,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: false,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: true,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: false,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: false,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: true,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: false,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: false,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: true,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: false,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: false,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: true,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: false,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: false,
      },
      {
        text: 'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
        time: '10:49',
        outgoing: true,
      },
    ],
  },
  {
    name: 'Киноклуб',
    lastMessage: 'стикер',
    unread: 0,
    time: '12:00',
    yourMessageLast: true,
  },
  {
    name: 'Илья',
    lastMessage:
      'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
    unread: 4,
    time: '15:12',
    yourMessageLast: false,
  },
  {
    name: 'Вадим',
    lastMessage: 'Круто',
    unread: 0,
    time: 'Пт',
    yourMessageLast: true,
  },
  {
    name: 'Андрей',
    lastMessage: 'Изображение',
    unread: 2,
    time: '10:49',
    yourMessageLast: false,
  },
  {
    name: 'Киноклуб',
    lastMessage: 'стикер',
    unread: 0,
    time: '12:00',
    yourMessageLast: true,
  },
  {
    name: 'Илья',
    lastMessage:
      'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
    unread: 4,
    time: '15:12',
    yourMessageLast: false,
  },
  {
    name: 'Вадим',
    lastMessage: 'Круто',
    unread: 0,
    time: 'Пт',
    yourMessageLast: true,
  },
  {
    name: 'Андрей',
    lastMessage: 'Изображение',
    unread: 2,
    time: '10:49',
    yourMessageLast: false,
  },
  {
    name: 'Киноклуб',
    lastMessage: 'стикер',
    unread: 0,
    time: '12:00',
    yourMessageLast: true,
  },
  {
    name: 'Илья',
    lastMessage:
      'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
    unread: 4,
    time: '15:12',
    yourMessageLast: false,
  },
  {
    name: 'Вадим',
    lastMessage: 'Круто',
    unread: 0,
    time: 'Пт',
    yourMessageLast: true,
  },
  {
    name: 'Андрей',
    lastMessage: 'Изображение',
    unread: 2,
    time: '10:49',
    yourMessageLast: false,
  },
  {
    name: 'Киноклуб',
    lastMessage: 'стикер',
    unread: 0,
    time: '12:00',
    yourMessageLast: true,
  },
  {
    name: 'Илья',
    lastMessage:
      'Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!',
    unread: 4,
    time: '15:12',
    yourMessageLast: false,
  },
  {
    name: 'Вадим',
    lastMessage: 'Круто',
    unread: 0,
    time: 'Пт',
    yourMessageLast: true,
  },
];

export const activeChat: Chat = chats[0];
